const {
    MMSBase
} = require("./MMSBase");

/** 墨芈赋 */
exports.MMF = new MMSBase([
    '一城一影，浪人留情。一字一意，游子无心。暮月，光之烁、影之魅、静水为平；暗点，血之腥、泪之清、笔墨为情。',
    '月入乌云涧，雨落夜色山;夕阳痴如醉，愚人净身睡。',
    "皓月当空蒙蒙夜路，秋风微起陌陌轻烟；谈人生有何不甘，落寞期间，已是落叶铺林间。",
    "一个人，时深沉，岁月心，次次冷；十年遇，偶欢喜，难离情，目目清。",
    "陌陌长路几相识，光阴穿梭难相知；时过境迁难齐聚，唯有一念皆太平。",
    "丝竹声悠悠，落叶随彼流；闹市人嚷嚷，鸳鸯并排游。",
    "俏看轻飞燕，衔泥水荡舟；不惧人相扰，一心用筑巢。",
    "细雨霏霏催人泪，清风徐徐叶做舟；市井繁华人心谎，山清水秀好倜傥。",
    "花开花亦落，枫叶红时火；待到花似火，一眠枫叶落。",
    "千千暮雨，秋夜微凉，叹人生苦长苦短；纷飞落叶，四季点点，述时光亦深亦浅。",
    "暮夜秋雨落纷纷，夜路行人声沉沉；仰面一叹游子声，微风拂衣心冷冷；花飞花亦落,潮涨潮意归；茫茫林海中,慌慌心筑笼。",
    "对对错错无非对错，是是非非不论是非；形形色色络绎不绝，断断续续精疲力竭；不自在，悲哀，不明白，去猜；几台戏，幕了，千杯酒，空了。",
    "一城一人候伊人，霓虹夜影月无声；纵横交织几束灯，无城无人独归人；小步漫漫不知冷，心绪沉沉夜行人；夜深深，满路尘，归几时，问何人，车水马龙夜归人。",
    "徒心妄生寥寥行，势为无昧非非离；挚信嫁沉深深髓，抛丝易衣空空等。",
    "明月清清当空照，万家嘻嘻对月饮；天灯遥遥离地去，虫鸣丝丝声不停。",
    "申猴跃跃入农屋，酉鸡扑扑出金笼；忽来噼啪爆竹响，猴奔鸡飞笑开场。",
    "风雨此来不是时，携云不知几落时；昨夜星辰何处在，要问皇天有心人。", "寒霜三分冻，深夜雨不停；晨起凉入骨，望友行添衣；盛夏似昨日，冬风幕时起；车水马龙间，飞雨不湿伞。",
    "夜游田园，两耳蛙声不断，试问今生还有几时可悦；远离围城，不闻车鸣喧哗，可叹来日不知多年相伴。",
    "晨起繁星引，暮归灯火行。", "昨夜举杯明月照，今朝推门落叶黄。",
    "谁戒了谁的温柔，又忘了谁的忧愁。", "山涧挂明月，梦里静无声。",
    "饮一杯淡酒，听一曲惆怅，望窗外灯火辉煌；尝一筷素菜，闻一声哭腔，看岁月蹉跎彷徨。",
    "夜雨本无意，闻者别用心；屋檐挂珠帘，行人伞遮肩。"
]);

/** 尘埃里 */
exports.CAL = new MMSBase([
    '时间带来无限可能，是否向前一程;何处消磨何处成，孰能无惑，可与不可。',
    '圆而圆复始，而于圆心，为何而动。是以时间为轮为轴，轮轴转而复始，往来何矣。',
    '修心修性修身而伴，于今已是春秋几分，自问于心，不知得舍。行于世而思于世，渐觉空寂，人与人何以为众生。',
    '三问:欲何求？求何果？果何得？',
    '曾阅古经几多，而经所著皆是引求知欲居首，然道法之道以自然为其法则。',
    '佛说前世今生轮回而至，道法自然万物唯一，古兰经和圣经皆是以主入教，然其果是以己为枷锁后施于后世人。',
    '曾经问佛，佛说施主无缘；而后问魔，魔说予子不受；而今问道，道言乃所行之之于心，今心已固，不破不立。'
]);

/** 莫说欣语 */
exports.MSXY = new MMSBase([
    '归于沉寂的内心，偶尔也会被激起一丝丝涟漪，而如沸水般汹涌，难得几合。你来了，带着振奋人心的呼喊声，伴随喜悦。漫长又短暂的等待，满怀期待。想象过无数次与你相遇，构思了无数次见面场景，而此时，我已深陷其中。一如当初，爱了，便是有万全准备也不及刹那间的幸福，陶醉其中。',
    '你结婚那天，本该与我无关，在满场宾客注视下我走向你，伸开双手准备拥抱你的瞬间，梦醒了。',
    '背靠窗口，闭上眼睛，耳机传来的旋律与身边的嘈杂交互成别味的感觉曲调，地铁启停间，感受乘客匆匆，睁开眼，走出车厢，入目中皆是陌路人。',
    '深夜，依靠在阳台躺椅，听着无形的夜雨声，望着远方星星点点的高楼和那一条条披着黄金匹练的道路，而后坠落在无边的回忆。'
]);